/**
 * Created by beiyannanfei on 2018/3/2.
 * 转换错误码(百度api)
 */
const logger = require("./log")(__filename);

const errCodeMap = {
	//图像识别相关错误码
	4: "图片识别异常，请稍后重试，错误码：4",//"集群超限额",
	14: "图片识别异常，请稍后重试，错误码：14",//"IAM鉴权失败，建议用户参照文档自查生成sign的方式是否正确，或换用控制台中ak sk的方式调用",
	17: "图片识别异常，请稍后重试，错误码：17",//"每天流量超限额",
	18: "图片识别异常，请稍后重试，错误码：18",//"QPS超限额",
	19: "图片识别异常，请稍后重试，错误码：19",//"请求总量超限额",
	100: "图片识别异常，请稍后重试，错误码：100",//"无效参数",
	110: "图片识别异常，请稍后重试，错误码：110",//"Access Token失效",
	111: "图片识别异常，请稍后重试，错误码：111",//"Access token过期",
	282000: "图片中文字过多，建议您对图片进行切割后再识别",//"服务器内部错误，如果您使用的是高精度接口，报这个错误码的原因可能是您上传的图片中文字过多，识别超时导致的，建议您对图片进行切割后再识别，其他情况请再次请求",
	216100: "图片识别异常，请稍后重试，错误码：216100",//"请求中包含非法参数，请检查后重新尝试",
	216101: "图片识别异常，请稍后重试，错误码：216101",//"缺少必须的参数，请检查参数是否有遗漏",
	216102: "图片识别异常，请稍后重试，错误码：216102",//"请求了不支持的服务，请检查调用的url",
	216103: "图片识别异常，请稍后重试，错误码：216103",//"请求中某些参数过长，请检查后重新尝试",
	216110: "图片识别异常，请稍后重试，错误码：216110",//"appid不存在，请重新核对信息是否为后台应用列表中的appid",
	216200: "图片为空，请检查后重新尝试",
	216201: "上传的图片格式错误，仅支持：PNG、JPG、JPEG、BMP格式图片",
	216202: "上传的图片大小错误，仅支持小于4M，分辨率不高于4096*4096的图片，请重新上传图片",
	216630: "识别错误，请再次请求",
	216631: "识别银行卡错误，请上传正确完整的图片",
	216633: "身份证识别异常，请上传正确完整的图片",
	216634: "图片识别异常，请稍后重试，错误码：216634",//"检测错误，请再次请求",
	282003: "图片识别异常，请稍后重试，错误码：282003",//"请求参数缺失",
	282005: "图片识别异常，请稍后重试，错误码：282005",//"处理批量任务时发生部分或全部错误",
	282006: "图片识别异常，请稍后重试，错误码：282006",//"批量任务处理数量超出限制，请将任务数量减少到10或10以下",
	282110: "图片识别异常，请稍后重试，错误码：282110",//"URL参数不存在，请核对URL后再次提交",
	282111: "图片识别异常，请稍后重试，错误码：282111",//"URL格式非法，请检查url格式是否符合相应接口的入参要求",
	282112: "图片识别异常，请稍后重试，错误码：282112",//"url下载超时，请检查url对应的图床/图片无法下载或链路状况不好，您可以重新尝试一下，如果多次尝试后仍不行，建议更换图片地址",
	282113: "图片识别异常，请稍后重试，错误码：282113",//"URL返回无效参数",
	282114: "图片识别异常，请稍后重试，错误码：282114",//"URL长度超过1024字节或为0",
	282808: "图片识别异常，请稍后重试，错误码：282808",//"request id xxxxx 不存在",
	282809: "图片识别异常，请稍后重试，错误码：282809",//"返回结果请求错误（不属于excel或json）",
	282810: "图片识别异常，请稍后重试，错误码：282810",//"图像识别错误",

	//其它错误转义
	"ESOCKETTIMEDOUT": "图片识别超时，建议对照片进行手机截屏，重新识别截屏图片"
};

/**
 * 转义百度api接口错误
 * @param errInfo
 * @returns {*}
 */
exports.goSwitchErr = function (errInfo) {
	if (!errInfo || !errInfo.error_code) {
		return "错误信息不存在";
	}
	logger.warn("goSwitchErr errInfo: %s", errInfo);
	let errCode = errInfo.error_code;
	let errMsg = errCodeMap[errCode];
	if (!errMsg) {
		return `未知错误，具体内容：${JSON.stringify(errInfo)}`;
	}
	return errMsg;
};


/**
 * 转义系统错误
 * @param errKey
 * @returns {*}
 */
exports.getErrInfo = function (errKey) {
	if (!errKey) {
		return null;
	}
	return errCodeMap[errKey];
};


